app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(:page => params[:page], :per_page => params[:per_page] ||= 30).order(created_at: :desc)
---
SELECT  "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "content", "category", "created_at", "updated_at", "user_id", "uuid") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "content" = ?, "category" = ?, "user_id" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Edited_Article_Title"], ["content", "New_New_Article_Content"], ["category", ""], ["user_id", 3], ["updated_at", "2019-04-05 12:13:09.735184"], ["id", 1]]

    def set_article
      @article = Article.friendly.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]