app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" ORDER BY "comments"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments"
---
  def index
    @comments = Comment.paginate(:page => params[:page], :per_page => params[:per_page] ||= 30).order(created_at: :desc)

INSERT INTO "comments" ("message", "visible", "article_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["message", "New_message_with_a_lot_of_typing"], ["visible", "t"], ["article_id", 1], ["created_at", "2019-04-05 13:12:02.498180"], ["updated_at", "2019-04-05 13:12:02.498180"], ["user_id", 1]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save

UPDATE "comments" SET "message" = ?, "article_id" = ?, "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["message", "Edited_Comment_Message"], ["article_id", 1], ["user_id", 1], ["updated_at", "2019-04-05 13:30:59.456668"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_comment
      @comment = Comment.friendly.find(params[:id])